OpenDTEF-v1812/tutorials/multiphase/overInterDyMFoam/boatAndPropeller/system/topoSetDictRefine
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    refineSet;       // all around bgr
        type    cellSet;
        action  new;
        source  zoneToCell;
        zone    background;
    }
    {
        name    refineSet;
        type    cellSet;
        action  subset;
        source  boxToCell;
        boxes
        (
            (-0.2 -0.2 -0.2)(0.04 0.2 0.2) //hullBox
        );
    }
);

// ************************************************************************* //
